app/controllers/page_controller.rb

SELECT  "vendors".* FROM "vendors" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "vendors"
---
  def vendors
    @vendors = Vendor.all.paginate(:page => params[:page])

SELECT "checklists".* FROM "checklists"
---
  def checklist
    @checklists = Checklist.all