app/controllers/vendors_controller.rb

SELECT  "vendors".* FROM "vendors" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "vendors"
---
  def index
  	@vendors = Vendor.all.paginate(:page => params[:page])